app/Controllers/AlumnoCursoController.php

    public function list($alumnoId)
    {
        $asignados = $this->alumnoCursoModel->where('alumno', $alumnoId)->findAll();
        $cursoIds = array_column($asignados, 'curso');
        if (empty($cursoIds)) {
            return $this->response->setJSON(['cursos' => [], 'ids' => []]);
        }
        $cursos = $this->cursoModel->whereIn('curso', $cursoIds)->findAll();
---
SELECT *
FROM `cursos`
WHERE `curso` IN ('2','4')

    public function allWithAssigned($alumnoId)
    {
        $todos = $this->cursoModel->findAll();
---
SELECT *
FROM `cursos`