app/Controllers/AlumnoController.php

    public function index()
    {
        // Traer alumnos con conteo de cursos asignados
        $db = \Config\Database::connect();
        $builder = $db->table('alumnos a')
            ->select('a.*, COUNT(ac.id) as cursos_count')
            ->join('alumnos_cursos ac', 'ac.alumno = a.alumno', 'left')
            ->groupBy('a.alumno');
        $data['alumnos'] = $builder->get()->getResultArray();
---
SELECT `a`.*, COUNT(ac.id) as cursos_count
FROM `alumnos` `a`
LEFT JOIN `alumnos_cursos` `ac` ON `ac`.`alumno` = `a`.`alumno`
GROUP BY `a`.`alumno`

    public function update($id)
    {
        $this->alumnoModel->update($id, [
            'nombre'    => $this->request->getPost('nombre'),
            'apellido'  => $this->request->getPost('apellido'),
            'direccion' => $this->request->getPost('direccion'),
            'movil'     => $this->request->getPost('movil'),
            'email'     => $this->request->getPost('email'),
            'user'      => 'admin',
            'inactivo'  => $this->request->getPost('inactivo') ?? 0,
        ]);
---
UPDATE `alumnos` SET `nombre` = 'Daniel', `apellido` = 'Mazariegos', `direccion` = 'Jutiapa', `movil` = '12341234', `email` = 'email2@domain.com', `user` = 'admin', `inactivo` = 0
WHERE `alumnos`.`alumno` IN ('2')