app/Controllers/CursoController.php

    public function index()
    {
        $data['cursos'] = $this->cursoModel->findAll();
---
SELECT *
FROM `cursos`

    public function store()
    {
        $datos = [
            'nombre'   => $this->request->getPost('nombre'),
            'profesor' => $this->request->getPost('profesor'),
            'inactivo' => 0,
        ];
        $this->cursoModel->save($datos);
---
INSERT INTO `cursos` (`nombre`, `profesor`, `inactivo`) VALUES ('Base de Datos', 'Daniel Ramos', 0)

    public function edit($id)
    {
        $data['curso'] = $this->cursoModel->find($id);
---
SELECT *
FROM `cursos`
WHERE `cursos`.`curso` = '2'

    public function update($id)
    {
        $this->cursoModel->update($id, [
            'nombre'   => $this->request->getPost('nombre'),
            'profesor' => $this->request->getPost('profesor'),
            'inactivo' => $this->request->getPost('inactivo') ?? 0,
        ]);
---
UPDATE `cursos` SET `nombre` = 'Desarrollo Web', `profesor` = 'Walter Cordova', `inactivo` = 0
WHERE `cursos`.`curso` IN ('2')